#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_security_group.lb_security_group: Refreshing state... [id=sg-01ccc61b6939b1ebb]
aws_apigatewayv2_vpc_link.vpclink_apigw_to_alb: Refreshing state... [id=mz3jld]
aws_apigatewayv2_api.apigw_http_endpoint: Refreshing state... [id=09affxpho3]
aws_security_group.ecs_security_group: Refreshing state... [id=sg-039abfdfa5e339c2f]
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:629239571689:cluster/demo-ecs-cluster]
aws_ecr_repository.app_container_repo: Refreshing state... [id=liamfit/sample-app]
aws_lb_target_group.alb_ecs_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:629239571689:targetgroup/tf-20221216174034793800000003/d4f89a04d26972f7]
aws_apigatewayv2_stage.apigw_stage: Refreshing state... [id=$default]
aws_security_group_rule.sg_ingress_rule_all_to_lb: Refreshing state... [id=sgrule-2410972938]
aws_security_group_rule.sg_egress_rule_lb_to_ecs_cluster: Refreshing state... [id=sgrule-1024811492]
aws_lb.ecs_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:629239571689:loadbalancer/app/tf-lb-20221216174037755800000004/b114272c58430f40]
aws_security_group_rule.sg_ingress_rule_ecs_cluster_from_lb: Refreshing state... [id=sgrule-4212065245]
aws_lb_listener.ecs_alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:629239571689:listener/app/tf-lb-20221216174037755800000004/b114272c58430f40/1a421617b47cd2d4]
aws_apigatewayv2_integration.apigw_integration: Refreshing state... [id=k7o4i9f]
aws_apigatewayv2_route.apigw_route: Refreshing state... [id=cyli370]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_cluster.ecs_cluster must be replaced
-/+ resource "aws_ecs_cluster" "ecs_cluster" {
      ~ arn                = "arn:aws:ecs:us-east-1:629239571689:cluster/demo-ecs-cluster" -> (known after apply)
      ~ capacity_providers = [] -> (known after apply)
      ~ id                 = "arn:aws:ecs:us-east-1:629239571689:cluster/demo-ecs-cluster" -> (known after apply)
      ~ name               = "demo-ecs-cluster" -> "ecs-cluster" # forces replacement
      - tags               = {} -> null
      ~ tags_all           = {} -> (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf_plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf_plan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @liamfit, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*